
Norm =  {   
            'ا' : ['أ', 'إ', 'آ', 'ئ', 'ء'],
            'ي' : ['ى'],
            'ة' : ['ه'],
        }

Articles =  {
                4 : ['وبال', 'فبال', 'لبال'],
                3 : ['بال', 'فال', 'وال', 'كال', 'ولل', 'الا'],
                2 : ['لل', 'ال', 'اا', 'لي'],
                1 : ['ا', 'ل']
            }

Prefixes =  {
                5 : ['وليست', 'فليست', 'اليست', 'افلست'],
                4 : ['اتست', 'ويست', 'فاست', 'واست', 'انهم', 'والم', 'باست', 'الاس', 'كمست', 'والا', 'فاست'],
                3 : ['مست', 'ولت', 'فلي', 'فلن', 'فلل', 'فان', 'يست', 'است', 'تست', 'فلي', 'وسي', 'وسن', 'فلا', 'وست', 'بمس'],
                2 : ['او', 'اي', 'ان', 'في', 'فب', 'فت', 'لي', 'فن', 'وب', 'فا', 'ول', 'وو', 'أف', 'في', 'لا', 'ات', 'وي', 'وت', 'سي', 'سن', 'وا', 'فا', 'وي', 'اا', 'مم', 'كت', 'مت', 'مس', 'وست', 'بمس'],
                1 : ['ل', 'ب', 'ف', 'س', 'و', 'ي', 'ت', 'ن', 'ا','م']
            }

Suffixes =  {
                5 : ['ناكمو', 'ناهما', 'كموها'],
                4 : ['موهم', 'موهن', 'ناكم', 'اءكم', 'اءنا', 'اءهم', 'نوهن', 'اؤهم', 'ونهم', 'ائهم', 'ناهم', 'ونكم', 'ونهم', 'ائنا', 'توهن', 'اتها', 'اتهم', 'ياته'],
                3 : ['تنا', 'نها', 'تان', 'ونه', 'اءه', 'ناه', 'هما', 'وها', 'نهم', 'وهم', 'وني', 'وهن', 'تها', 'تهم', 'نكم', 'هات', 'تان', 'تهن', 'وكم', 'ونه', 'ونك', 'انك', 'ائك', 'يهم'],
                2 : ['ان', 'ين', 'ون', 'نا', 'تم', 'تا', 'ون', 'وا', 'ات', 'ان', 'ين', 'تن', 'كم', 'هن', 'نا', 'يا', 'ها', 'تم', 'كن', 'ني', 'وا', 'ما', 'هم', 'ها', 'وك', 'وت', 'وة', 'ية'],
                1 : ['ة', 'ه', 'ي', 'ك', 'ت', 'ا', 'ن']
            }
# أفاستسقيناكموها
# افاستسقيناكموها
# افاستسقينا
# افاستسقي
# افاستسق

def test():
    s = 'وبالوادي'
    for artLen in Articles:
        for article in Articles[artLen]:
            if article in s:
                print("Contains" , article) 